app/models/address.rb

  def already_exists?
    Address.where(customer_id: customer_id, recipient: recipient, zip: zip).exists?
---
SELECT 1 AS one FROM "addresses" WHERE "addresses"."customer_id" = ? AND "addresses"."recipient" = ? AND "addresses"."zip" = ? LIMIT ?  [["customer_id", 1], ["recipient", "Alice Anderson"], ["zip", "15213"], ["LIMIT", 1]]