app/models/order.rb

  def customer_must_be_active
    ### below code copied from PATS
    active_customers = Customer.active.all.map{|c| c.id}
---
SELECT "customers".* FROM "customers" WHERE "customers"."active" = ?  [["active", 1]]

  def address_must_be_active
    ### below code copied from PATS
    active_addresses = Address.active.all.map{|c| c.id}
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."active" = ?  [["active", 1]]